{
  "format": "layers-model",
  "generatedBy": "keras v3.13.2",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "modelTopology": {
    "keras_version": "3.13.2",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Functional",
      "config": {
        "name": "functional",
        "trainable": true,
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batchInputShape": [null, 34],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "input_layer",
              "optional": false
            },
            "name": "input_layer",
            "inbound_nodes": []
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "dtype": "float32",
              "units": 128,
              "activation": "relu6",
              "use_bias": true
            },
            "name": "dense",
            "inbound_nodes": [[["input_layer", 0, 0, {}]]]
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.5
            },
            "name": "dropout",
            "inbound_nodes": [[["dense", 0, 0, {}]]]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": "float32",
              "units": 64,
              "activation": "relu6",
              "use_bias": true
            },
            "name": "dense_1",
            "inbound_nodes": [[["dropout", 0, 0, {}]]]
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_1",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.5
            },
            "name": "dropout_1",
            "inbound_nodes": [[["dense_1", 0, 0, {}]]]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_2",
              "trainable": true,
              "dtype": "float32",
              "units": 8,
              "activation": "softmax",
              "use_bias": true
            },
            "name": "dense_2",
            "inbound_nodes": [[["dropout_1", 0, 0, {}]]]
          }
        ],
        "input_layers": [["input_layer", 0, 0]],
        "output_layers": [["dense_2", 0, 0]]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        { "name": "dense/kernel", "shape": [34, 128], "dtype": "float32" },
        { "name": "dense/bias", "shape": [128], "dtype": "float32" },
        { "name": "dense_1/kernel", "shape": [128, 64], "dtype": "float32" },
        { "name": "dense_1/bias", "shape": [64], "dtype": "float32" },
        { "name": "dense_2/kernel", "shape": [64, 8], "dtype": "float32" },
        { "name": "dense_2/bias", "shape": [8], "dtype": "float32" }
      ]
    }
  ]
}